In [6]:
import pandas as pd

data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [8]:
df['salario'] = [30000, 45000, 38000, 32000]
df

   Nombre  Edad     Ciudad  salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

In [9]:
df['salario'] = df['salario'] + 2000
df

   Nombre  Edad     Ciudad  salario
0     Ana    25     Madrid    32000
1    Luis    30  Barcelona    47000
2  Carlos    22   Valencia    40000
3    Sara    27     Bilbao    34000

In [11]:
nombres = df['Nombre']
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [12]:
mayores_25 = df[df["Edad"] > 25]
mayores_25

  Nombre  Edad     Ciudad  salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000

In [17]:
edades = df["Edad"]
mayores_25 = df[edades>25]
mayores_25

  Nombre  Edad     Ciudad  salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000